app/views/albums/show.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."album_id" = $1  [["album_id", 44]]
---
<img src="<%= @album.cover_url %>">
<% @album.pictures.each do |picture| %>