app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def show
  	@album = Album.find(params[:id])