app/controllers/albums_controller.rb

  def index
  	@albums = Album.all
---
SELECT "albums".* FROM "albums" ORDER BY created_at