app/controllers/picture_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "albums" SET "view_count" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["view_count", 1], ["updated_at", "2017-10-05 20:44:03.934437"], ["id", 1]]
UPDATE "pictures" SET "view_count" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["view_count", 1], ["updated_at", "2017-10-05 20:36:51.354358"], ["id", 1]]
---
	def show
		@picture = Picture.find(params[:id])
		update_view_count
		@breadcums.push title: "Albums", url: albums_path
		@breadcums.push title: @picture.album.author, url: album_path(@picture.album.id)